cases/convTest/_10x/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (
      "libsimpleSwakFunctionObjects.so"
      "libswakFunctionObjects.so"
      "libgroovyBC.so"
      "libextrapolatedGradient.so"
     );
     
startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

//deltaT          0.1;
deltaT          0.000390625;

writeControl    runTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  no;

// maxCo
maxCo           2.5;

// maxDeltaT
maxDeltaT       1;

functions
{
    libs            ("libfieldFunctionObjects.so");

    Ma
    {
        type            MachNumber;
        executeControl  writeTime;
        writeControl    writeTime;
        UName           U;
    }
}


// ************************************************************************* //
