cases/convTest/_10x/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -2 -0.05)
    (4 -2 -0.05)
    (4 2 -0.05)
    (0 2 -0.05)
    (0 -2 0.05)
    (4 -2 0.05)
    (4 2 0.05)
    (0 2 0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    // sides
    // {
        // type cyclic;
        // faces
        // (
            // (0 4 7 3)
            // (2 6 5 1)
        // );
    // }
);

mergePatchPairs
(
);


// ************************************************************************* //
