cases/convTest/_10x/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
10
(
(0 -0.158612314779744 0)
(0 -0.158654314527396 0)
(0 -0.162923985572141 0)
(0 -0.178039401592977 0)
(0 -0.129263076970608 0)
(0 -0.146732880367365 0)
(0 -0.323307954784792 0)
(0 -0.378680775742531 0)
(0 -0.394523799155 0)
(0 -0.394688351072542 0)
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 -0.394688351072542 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
